{
  "tips": [
    "Take care of your mental health in this major. Find some healthy coping mechanisms like working out or going for walks.",
    "Have personal projects. Work on things in your free time to further your skills.",
    "Take a shower. Please. Do not make the CS major allegations true.",
    "Explore different tracks and find what works for you. SWE/ML may not be for you and that's okay.",
    "Take some fun classes. ",
    "Comparison is the thief of joy. It's easy to feel discouraged with so many smart people around. Focus on your own goals and know you'll get there too.",
    "Apply to internships early. Do not wait until spring semester to look for summer opportunities.",
    "Try to find at least one internship before your senior year.",
    "If you don't like having to learn an adapt, CS may not be for you.",
    "Don't trust/use Chat-GPT 100%. It will bite you in the butt. You're going to Purdue for CS, not GPT.",
    "Have 2 friend groups. You don't want a falling out with friends to cause you to spiral.",
    "Don't hold back from things because you're not confident enough. You got this.",
    "Talk to people in your CS classes. Try to make friends because it's a lot less painful to suffer through CS classes together.",
    "Try to tailor your resume towards the position and company your are applying to.",
    "Chat-GPT is a great tool for explaining things. Do not get reliant on it.",
    "It's not the end of the world if you have to retake a class. Just get that Purdue Grit and you'll be good.",
    "Procrastination will ruin your college experience. Build good time-management habits.",
    "Plan your schedule carefully. Balance hard and easy classes each semester.",
    "Attend career fairs, even as a freshman. It’s great practice and you’ll make valuable connections.",
    "Learn to use Git/GitHub early. Version control is essential for coding projects.",
    "Start building your LinkedIn profile. Connect with peers, professors, and recruiters.",
    "Use Purdue’s free resources, like the writing lab or counseling services. They’re there to help you.",
    "Don't ignore your gen-ed courses. They’re a good way to explore interests outside CS.",
    "Form study groups for hard classes. Two minds are often better than one.",
    "Don’t be afraid to ask questions in class. Professors appreciate engaged students.",
    "Get familiar with Purdue’s Brightspace and myPurdue systems. It’ll save you time and stress.",
    "Experiment with different programming languages. Java, Python, and C++ are just the start.",
    "Practice coding on LeetCode or HackerRank. It’s great prep for technical interviews.",
    "Take notes by hand during lectures. It can help with retention and focus.",
    "Learn to manage stress during exams. Use breathing exercises or take short breaks.",
    "Office hours aren't just for help. Use them to build relationships with professors.",
    "Don’t overload your schedule with too many extracurriculars. Leave time for yourself.",
    "Use the Purdue CoRec to stay active. Physical fitness boosts mental performance.",
    "Stay up-to-date with the syllabus. Professors won’t remind you about every deadline.",
    "Don’t expect to understand everything immediately. CS concepts take time to sink in.",
    "Learn the basics of UNIX and command-line tools. You’ll use them throughout your degree.",
    "Celebrate small wins. Finishing an assignment or understanding a tough concept is worth acknowledging."
  ]
}